# SerpensGate-YOLOv8 模型配置文件
# 基于YOLOv8n架构，集成DySnakeConv和SPPELAN优化

# 参数
nc: 15  # 类别数
scales:
  n: [0.33, 0.25, 1024]  # YOLOv8n尺度

# 骨干网络 (Backbone)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]   # 2 - 可替换为C2f_DySnake
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]   # 4 - 可替换为C2f_DySnake
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]   # 6 - 可替换为C2f_DySnake
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]  # 8 - 可替换为C2f_DySnake
  - [-1, 1, SPPF, [1024, 5]]    # 9 - 可替换为SPPELAN

# 颈部网络 (Head)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]        # 12 - 可替换为C2f_DySnake

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]        # 15 (P3/8-small) - 可替换为C2f_DySnake

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]         # 18 (P4/16-medium) - 可替换为C2f_DySnake

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]   # cat head P5
  - [-1, 3, C2f, [1024]]        # 21 (P5/32-large) - 可替换为C2f_DySnake

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)
